{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "APPOINTMENT_SCHEDULING",
    "1": "RAG_QUERY",
    "2": "GREETING",
    "3": "EXIT",
    "4": "UNCLEAR"
  },
  "initializer_range": 0.02,
  "label2id": {
    "APPOINTMENT_SCHEDULING": 0,
    "EXIT": 3,
    "GREETING": 2,
    "RAG_QUERY": 1,
    "UNCLEAR": 4
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.3",
  "vocab_size": 30522
}
